---
kind: method
id: M:Autodesk.Revit.DB.FootPrintRoof.GetProfiles
source: html/72204bf1-21a8-0cbb-673c-630cc125b05c.htm
---
# Autodesk.Revit.DB.FootPrintRoof.GetProfiles Method

Retrieve all the curveLoops of FootPrintRoof.

## Syntax (C#)
```csharp
public ModelCurveArrArray GetProfiles()
```